jonahn/EE478/Lab2/PIC_SOURCES/h/p18f97j94.h
extern volatile far  unsigned char       PORTL;
extern volatile far  struct {
  unsigned RL0:1;
  unsigned RL1:1;
  unsigned RL2:1;
  unsigned RL3:1;
  unsigned RL4:1;
  unsigned RL5:1;
  unsigned RL6:1;
  unsigned RL7:1;
} PORTLbits;
extern volatile far  unsigned char       LATL;
extern volatile far  struct {
  unsigned LATL0:1;
  unsigned LATL1:1;
  unsigned LATL2:1;
  unsigned LATL3:1;
  unsigned LATL4:1;
  unsigned LATL5:1;
  unsigned LATL6:1;
  unsigned LATL7:1;
} LATLbits;
extern volatile far  unsigned char       TRISL;
extern volatile far  struct {
  unsigned TRISL0:1;
  unsigned TRISL1:1;
  unsigned TRISL2:1;
  unsigned TRISL3:1;
  unsigned TRISL4:1;
  unsigned TRISL5:1;
  unsigned TRISL6:1;
  unsigned TRISL7:1;
} TRISLbits;
extern volatile far  unsigned char       PORTK;
extern volatile far  struct {
  unsigned RK0:1;
  unsigned RK1:1;
  unsigned RK2:1;
  unsigned RK3:1;
  unsigned RK4:1;
  unsigned RK5:1;
  unsigned RK6:1;
  unsigned RK7:1;
} PORTKbits;
extern volatile far  unsigned char       LATK;
extern volatile far  struct {
  unsigned LATK0:1;
  unsigned LATK1:1;
  unsigned LATK2:1;
  unsigned LATK3:1;
  unsigned LATK4:1;
  unsigned LATK5:1;
  unsigned LATK6:1;
  unsigned LATK7:1;
} LATKbits;
extern volatile far  unsigned char       TRISK;
extern volatile far  struct {
  unsigned TRISK0:1;
  unsigned TRISK1:1;
  unsigned TRISK2:1;
  unsigned TRISK3:1;
  unsigned TRISK4:1;
  unsigned TRISK5:1;
  unsigned TRISK6:1;
  unsigned TRISK7:1;
} TRISKbits;
extern volatile far  unsigned char       ODCON2;
extern volatile far  struct {
  unsigned ECCP3OD:1;
  unsigned CCP4OD:1;
  unsigned CCP5OD:1;
  unsigned CCP6OD:1;
  unsigned CCP7OD:1;
  unsigned CCP8OD:1;
  unsigned CCP9OD:1;
  unsigned CCP10OD:1;
} ODCON2bits;
extern volatile far  unsigned char       ODCON1;
extern volatile far  struct {
  unsigned SSP1OD:1;
  unsigned SSP2OD:1;
  unsigned USART1OD:1;
  unsigned USART2OD:1;
  unsigned USART3OD:1;
  unsigned USART4OD:1;
  unsigned ECCP1OD:1;
  unsigned ECCP2OD:1;
} ODCON1bits;
extern volatile far  unsigned char       MDCARL;
extern volatile far  union {
  struct {
    unsigned MDCL:4;
    unsigned :1;
    unsigned MDCLSYNC:1;
    unsigned MDCLPOL:1;
    unsigned MDCLODIS:1;
  };
  struct {
    unsigned MDCL0:1;
    unsigned MDCL1:1;
    unsigned MDCL2:1;
    unsigned MDCL3:1;
  };
} MDCARLbits;
extern volatile far  unsigned char       MDCARH;
extern volatile far  union {
  struct {
    unsigned MDCH:4;
    unsigned :1;
    unsigned MDCHSYNC:1;
    unsigned MDCHPOL:1;
    unsigned MDCHODIS:1;
  };
  struct {
    unsigned MDCH0:1;
    unsigned MDCH1:1;
    unsigned MDCH2:1;
    unsigned MDCH3:1;
  };
} MDCARHbits;
extern volatile far  unsigned char       MDSRC;
extern volatile far  union {
  struct {
    unsigned MDSRC:4;
    unsigned :3;
    unsigned MDSODIS:1;
  };
  struct {
    unsigned MDSRC0:1;
    unsigned MDSRC1:1;
    unsigned MDSRC2:1;
    unsigned MDSRC3:1;
  };
} MDSRCbits;
extern volatile far  unsigned char       MDCON;
extern volatile far  struct {
  unsigned MDBIT:1;
  unsigned :2;
  unsigned MDO:1;
  unsigned MDOPOL:1;
  unsigned MDSLR:1;
  unsigned MDOE:1;
  unsigned MDEN:1;
} MDCONbits;
extern volatile far  unsigned char       PMD4;
extern volatile far  struct {
  unsigned EMBMD:1;
  unsigned :1;
  unsigned LVDMD:1;
  unsigned IOCMD:1;
  unsigned USBMD:1;
  unsigned CMP3MD:1;
  unsigned CMP2MD:1;
  unsigned CMP1MD:1;
} PMD4bits;
extern volatile far  unsigned char       PMD3;
extern volatile far  union {
  struct {
    unsigned REFO2MD:1;
    unsigned REFO1MD:1;
    unsigned PSPMD:1;
    unsigned LCDMD:1;
    unsigned RTCCMD:1;
    unsigned ADCMD:1;
    unsigned CTMUMD:1;
    unsigned MODMD:1;
  };
  struct {
    unsigned :7;
    unsigned TXMMD:1;
  };
} PMD3bits;
extern volatile far  unsigned char       PMD2;
extern volatile far  struct {
  unsigned TMR0MD:1;
  unsigned TMR1MD:1;
  unsigned TMR2MD:1;
  unsigned TMR3MD:1;
  unsigned TMR4MD:1;
  unsigned TMR5MD:1;
  unsigned TMR6MD:1;
  unsigned TMR8MD:1;
} PMD2bits;
extern volatile far  unsigned char       PMD1;
extern volatile far  struct {
  unsigned SSP1MD:1;
  unsigned SSP2MD:1;
  unsigned UART1MD:1;
  unsigned UART2MD:1;
  unsigned UART3MD:1;
  unsigned UART4MD:1;
  unsigned ECCP1MD:1;
  unsigned ECCP2MD:1;
} PMD1bits;
extern volatile far  unsigned char       PMD0;
extern volatile far  struct {
  unsigned ECCP3MD:1;
  unsigned CCP4MD:1;
  unsigned CCP5MD:1;
  unsigned CCP6MD:1;
  unsigned CCP7MD:1;
  unsigned CCP8MD:1;
  unsigned CCP9MD:1;
  unsigned CCP10MD:1;
} PMD0bits;
extern volatile far  unsigned char       CTMUCON4;
extern volatile far  union {
  struct {
    unsigned EDG1STAT:1;
    unsigned EDG2STAT:1;
    unsigned EDG1SEL:4;
    unsigned EDG1POL:1;
    unsigned EDG1EN:1;
  };
  struct {
    unsigned :2;
    unsigned EDG1SEL0:1;
    unsigned EDG1SEL1:1;
    unsigned EDG1SEL2:1;
    unsigned EDG1SEL3:1;
  };
} CTMUCON4bits;
extern volatile far  unsigned char       CTMUCON3;
extern volatile far  union {
  struct {
    unsigned :2;
    unsigned EDG2SEL:4;
    unsigned EDG2POL:1;
    unsigned EDG2EN:1;
  };
  struct {
    unsigned :2;
    unsigned EDG2SEL0:1;
    unsigned EDG2SEL1:1;
    unsigned EDG2SEL2:1;
    unsigned EDG2SEL3:1;
  };
} CTMUCON3bits;
extern volatile far  unsigned char       CTMUCON2;
extern volatile far  union {
  struct {
    unsigned IRNG:2;
    unsigned ITRIM:6;
  };
  struct {
    unsigned IRNG0:1;
    unsigned IRNG1:1;
    unsigned ITRIM0:1;
    unsigned ITRIM1:1;
    unsigned ITRIM2:1;
    unsigned ITRIM3:1;
    unsigned ITRIM4:1;
    unsigned ITRIM5:1;
  };
} CTMUCON2bits;
extern volatile far  unsigned char       CTMUCON1;
extern volatile far  struct {
  unsigned CTTRIG:1;
  unsigned IDISSEN:1;
  unsigned EDGSEQEN:1;
  unsigned EDGEN:1;
  unsigned TGEN:1;
  unsigned CTMUSIDL:1;
  unsigned :1;
  unsigned CTMUEN:1;
} CTMUCON1bits;
extern volatile far  unsigned char       TXREG4;
extern volatile far  unsigned char       RCREG4;
extern volatile far  unsigned char       SPBRG4;
extern volatile far  union {
  struct {
    unsigned SPBRG4:8;
  };
  struct {
    unsigned BRG0:1;
    unsigned BRG1:1;
    unsigned BRG2:1;
    unsigned BRG3:1;
    unsigned BRG4:1;
    unsigned BRG5:1;
    unsigned BRG6:1;
    unsigned BRG7:1;
  };
} SPBRG4bits;
extern volatile far  unsigned char       SPBRGH4;
extern volatile far  union {
  struct {
    unsigned SPBRGH4:8;
  };
  struct {
    unsigned BRG8:1;
    unsigned BRG9:1;
    unsigned BRG10:1;
    unsigned BRG11:1;
    unsigned BRG12:1;
    unsigned BRG13:1;
    unsigned BRG14:1;
    unsigned BRG15:1;
  };
} SPBRGH4bits;
extern volatile far  unsigned char       BAUDCON4;
extern volatile far  struct {
  unsigned ABDEN:1;
  unsigned WUE:1;
  unsigned IREN:1;
  unsigned BRG16:1;
  unsigned TXCKP:1;
  unsigned RXDTP:1;
  unsigned RCIDL:1;
  unsigned ABDOVF:1;
} BAUDCON4bits;
extern volatile far  unsigned char       TXSTA4;
extern volatile far  struct {
  unsigned TX9D:1;
  unsigned TRMT:1;
  unsigned BRGH:1;
  unsigned SENDB:1;
  unsigned SYNC:1;
  unsigned TXEN:1;
  unsigned TX9:1;
  unsigned CSRC:1;
} TXSTA4bits;
